cask "google-chrome"
cask "iterm2"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "docker"

brew "git"
brew "jq"
brew "curl"
brew "mysql-client"
brew "aws-sam-cli"
brew "awscli"
brew "wget"

tap "adzuna/adzuna-ssm", "git@bitbucket.org:adzuna/adzuna-ssm-brew.git"
brew "adzuna-ssm"
tap "adzuna/adzuna-dev", "git@bitbucket.org:adzuna/adzuna-dev-brew.git"
brew "adzuna-dev"