# Basic apps
cask "google-chrome"
cask "slack"
cask "spotify"
cask "alfred" # task launcher
cask "sizeup" # window resizer
cask "caffeine" # stop the mac sleeping
cask "1password"
cask "1password-cli"

# Developer apps
cask "visual-studio-code"
cask "docker-desktop"
cask "ghostty"
cask "iterm2"
cask "font-fira-code"
brew "starship" # fancy shell

# More dev bits
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "git"
brew "jq"
brew "curl"
brew "mysql-client"
brew "aws-sam-cli"
brew "awscli"
brew "wget"
brew "bat"
brew "glow"

# Custom Adzuna helper apps
tap "adzuna/adzuna-ssm", "git@bitbucket.org:adzuna/adzuna-ssm-brew.git"
brew "adzuna/adzuna-ssm/adzuna-ssm"
tap "adzuna/adzuna-dev", "git@bitbucket.org:adzuna/adzuna-dev-brew.git"
brew "adzuna/adzuna-dev/adzuna-dev"
